CoreMaker-lab/STM32C542CC_IIS3DWB10IS/STM32C5_IIS3DWB10IS_Project2/STM32C5_IIS3DWB10IS_Project2_cmake/iis3dwb10is_reg.h
#define IIS3DWB10IS_COUNTER_BDR_L                0x09U
typedef struct
{
  uint8_t cnt_bdr_th               : 8;
} iis3dwb10is_counter_bdr_l_t;

#define IIS3DWB10IS_PLL_CTRL_1                   0x0AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ref_div                      : 3;
  uint8_t not_used0                    : 4;
  uint8_t osc_ext_sel                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t osc_ext_sel                  : 1;
  uint8_t not_used0                    : 4;
  uint8_t ref_div                      : 3;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_pll_ctrl_1_t;

#define IIS3DWB10IS_PLL_CTRL_2                   0x0BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pll_div                      : 6;
  uint8_t not_used0                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t pll_div                      : 6;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_pll_ctrl_2_t;

#define IIS3DWB10IS_INT_CTRL1                    0x0CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_drdy_temp               : 1;
  uint8_t int1_drdy_temp               : 1;
  uint8_t not_used0                    : 2;
  uint8_t int1_boot                    : 1;
  uint8_t int2_sleep_ispu              : 1;
  uint8_t int2_on_int1                 : 1;
  uint8_t pulsed_dataready             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pulsed_dataready             : 1;
  uint8_t int2_on_int1                 : 1;
  uint8_t int2_sleep_ispu              : 1;
  uint8_t int1_boot                    : 1;
  uint8_t not_used0                    : 2;
  uint8_t int1_drdy_temp               : 1;
  uint8_t int2_drdy_temp               : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_int_ctrl1_t;

#define IIS3DWB10IS_INT_CTRL2                    0x0DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_drdy_xl                 : 1;
  uint8_t not_used0                    : 1;
  uint8_t int1_sleepcnt                : 1;
  uint8_t int1_ext_trig                : 1;
  uint8_t int1_fifo_th                 : 1;
  uint8_t int1_fifo_ovr                : 1;
  uint8_t int1_fifo_full               : 1;
  uint8_t int1_counter_bdr             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_counter_bdr             : 1;
  uint8_t int1_fifo_full               : 1;
  uint8_t int1_fifo_ovr                : 1;
  uint8_t int1_fifo_th                 : 1;
  uint8_t int1_ext_trig                : 1;
  uint8_t int1_sleepcnt                : 1;
  uint8_t not_used0                    : 1;
  uint8_t int1_drdy_xl                 : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_int_ctrl2_t;

#define IIS3DWB10IS_INT_CTRL3                    0x0EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_drdy_xl                 : 1;
  uint8_t not_used1                    : 1;
  uint8_t int2_sleepcnt                : 1;
  uint8_t not_used0                    : 1;
  uint8_t int2_fifo_th                 : 1;
  uint8_t int2_fifo_ovr                : 1;
  uint8_t int2_fifo_full               : 1;
  uint8_t int2_counter_bdr             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_counter_bdr             : 1;
  uint8_t int2_fifo_full               : 1;
  uint8_t int2_fifo_ovr                : 1;
  uint8_t int2_fifo_th                 : 1;
  uint8_t not_used0                    : 1;
  uint8_t int2_sleepcnt                : 1;
  uint8_t not_used1                    : 1;
  uint8_t int2_drdy_xl                 : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_int_ctrl3_t;

#define IIS3DWB10IS_WHO_AM_I                     0x0FU

#define IIS3DWB10IS_CTRL1                        0x10U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t odr_xl                       : 4;
  uint8_t burst_cfg                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t burst_cfg                    : 4;
  uint8_t odr_xl                       : 4;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ctrl1_t;

#define IIS3DWB10IS_CTRL2                        0x11U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t fs_xl                        : 2;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t fs_xl                        : 2;
  uint8_t not_used0                    : 5;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ctrl2_t;

#define IIS3DWB10IS_CTRL3                        0x12U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sw_reset                     : 1;
  uint8_t not_used0                    : 1;
  uint8_t if_inc                       : 1;
  uint8_t ispu_en                      : 1;
  uint8_t fifo_en                      : 1;
  uint8_t burst_force_trg              : 1;
  uint8_t bdu                          : 1;
  uint8_t boot                         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot                         : 1;
  uint8_t bdu                          : 1;
  uint8_t burst_force_trg              : 1;
  uint8_t fifo_en                      : 1;
  uint8_t ispu_en                      : 1;
  uint8_t if_inc                       : 1;
  uint8_t not_used0                    : 1;
  uint8_t sw_reset                     : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ctrl3_t;

#define IIS3DWB10IS_CTRL4                        0x13U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_in_lh                   : 1;
  uint8_t not_used0                    : 1;
  uint8_t x_axis_enable                : 1;
  uint8_t y_axis_enable                : 1;
  uint8_t z_axis_enable                : 1;
  uint8_t not_used1                    : 1;
  uint8_t rounding                     : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t rounding                     : 2;
  uint8_t not_used1                    : 1;
  uint8_t z_axis_enable                : 1;
  uint8_t y_axis_enable                : 1;
  uint8_t x_axis_enable                : 1;
  uint8_t not_used0                    : 1;
  uint8_t int2_in_lh                   : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ctrl4_t;

#define IIS3DWB10IS_I3C_CTRL                     0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int_en_i3c                   : 1;
  uint8_t bus_act_sel                  : 2;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t bus_act_sel                  : 2;
  uint8_t int_en_i3c                   : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_i3c_ctrl_t;

#define IIS3DWB10IS_SPI_CTRL                     0x15U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sim                          : 1;
  uint8_t not_used0                    : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 7;
  uint8_t sim                          : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_spi_ctrl_t;

#define IIS3DWB10IS_ST_CTRL                      0x17U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st_sign                      : 1;
  uint8_t st_en                        : 2;
  uint8_t not_used0                    : 1;
  uint8_t lpf1_cfg                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t lpf1_cfg                     : 4;
  uint8_t not_used0                    : 1;
  uint8_t st_en                        : 2;
  uint8_t st_sign                      : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_st_ctrl_t;

#define IIS3DWB10IS_ISPU_CTRL1                   0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_bdu                     : 1;
  uint8_t not_used0                    : 1;
  uint8_t loprio_user_trig             : 1;
  uint8_t reg_access_confirm           : 1;
  uint8_t ispu_rate                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_rate                    : 4;
  uint8_t reg_access_confirm           : 1;
  uint8_t loprio_user_trig             : 1;
  uint8_t not_used0                    : 1;
  uint8_t ispu_bdu                     : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_ctrl1_t;

#define IIS3DWB10IS_ISPU_CTRL2                   0x19U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t sw_reset_ispu                : 1;
  uint8_t timestamp_en                 : 1;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t timestamp_en                 : 1;
  uint8_t sw_reset_ispu                : 1;
  uint8_t not_used0                    : 4;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_ctrl2_t;

#define IIS3DWB10IS_ISPU_INT_STATUS1_MAINPAGE    0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_ia                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_ia                      : 8;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_int_status1_mainpage_t;

