CoreMaker-lab/STM32C542CC_IIS3DWB10IS/STM32C5_IIS3DWB10IS_Project2/STM32C5_IIS3DWB10IS_Project2_cmake/iis3dwb10is_reg.h
#define IIS3DWB10IS_ISPU_INT_STATUS2_MAINPAGE    0x1BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_ia                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_ia                      : 8;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_int_status2_mainpage_t;

#define IIS3DWB10IS_STATUS_REG                   0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlda                         : 1;
  uint8_t not_used1                    : 1;
  uint8_t tda                          : 1;
  uint8_t sleepcnt_ia                  : 1;
  uint8_t ext_trig_ia                  : 1;
  uint8_t not_used0                    : 1;
  uint8_t ispu_ia                      : 1;
  uint8_t timestamp_endcount           : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp_endcount           : 1;
  uint8_t ispu_ia                      : 1;
  uint8_t not_used0                    : 1;
  uint8_t ext_trig_ia                  : 1;
  uint8_t sleepcnt_ia                  : 1;
  uint8_t tda                          : 1;
  uint8_t not_used1                    : 1;
  uint8_t xlda                         : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_status_reg_t;

#define IIS3DWB10IS_TPF                          0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tpf                          : 4;
  uint8_t not_used0                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t tpf                          : 4;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_tpf_t;

#define IIS3DWB10IS_DEVICE_STATUS                0x21U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 6;
  uint8_t ispu_ctrl_access             : 1;
  uint8_t ispu_core_sleep              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_core_sleep              : 1;
  uint8_t ispu_ctrl_access             : 1;
  uint8_t not_used0                    : 6;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_device_status_t;

#define IIS3DWB10IS_OUT_TEMP_L                   0x22U
#define IIS3DWB10IS_OUT_TEMP_H                   0x23U
#define IIS3DWB10IS_OUTX_L_A                     0x24U
#define IIS3DWB10IS_OUTX_M_A                     0x25U
#define IIS3DWB10IS_OUTX_H_A                     0x26U
#define IIS3DWB10IS_OUTX_HH_A                    0x27U
#define IIS3DWB10IS_OUTY_L_A                     0x28U
#define IIS3DWB10IS_OUTY_M_A                     0x29U
#define IIS3DWB10IS_OUTY_H_A                     0x2AU
#define IIS3DWB10IS_OUTY_HH_A                    0x2BU
#define IIS3DWB10IS_OUTZ_L_A                     0x2CU
#define IIS3DWB10IS_OUTZ_M_A                     0x2DU
#define IIS3DWB10IS_OUTZ_H_A                     0x2EU
#define IIS3DWB10IS_OUTZ_HH_A                    0x2FU
#define IIS3DWB10IS_TIMESTAMP0                   0x30U
#define IIS3DWB10IS_TIMESTAMP1                   0x31U
#define IIS3DWB10IS_TIMESTAMP2                   0x32U
#define IIS3DWB10IS_TIMESTAMP3                   0x33U
#define IIS3DWB10IS_TIMESTAMP4                   0x34U

#define IIS3DWB10IS_SLEEPCNT_CFG                 0x38U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tick_sel                     : 1;
  uint8_t enable_sleepcnt              : 1;
  uint8_t not_used1                    : 1;
  uint8_t rst_sleepcnt                 : 1;
  uint8_t not_used0                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t rst_sleepcnt                 : 1;
  uint8_t not_used1                    : 1;
  uint8_t enable_sleepcnt              : 1;
  uint8_t tick_sel                     : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_sleepcnt_cfg_t;

#define IIS3DWB10IS_ISPU_LOPRIO_EN               0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t loprio_fifo_en               : 1;
  uint8_t loprio_sleepcnt_en           : 1;
  uint8_t not_used1                    : 1;
  uint8_t loprio_ext_trg_en            : 1;
  uint8_t loprio_user_trg_en           : 1;
  uint8_t loprio_temp_en               : 1;
  uint8_t not_used0                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t loprio_temp_en               : 1;
  uint8_t loprio_user_trg_en           : 1;
  uint8_t loprio_ext_trg_en            : 1;
  uint8_t not_used1                    : 1;
  uint8_t loprio_sleepcnt_en           : 1;
  uint8_t loprio_fifo_en               : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_loprio_en_t;

#define IIS3DWB10IS_SLEEPCNT_TH_L                0x3EU
#define IIS3DWB10IS_SLEEPCNT_TH_H                0x3FU

#define IIS3DWB10IS_FIFO_DATA_OUT_TAG            0x40U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tag_sensor                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tag_sensor                   : 8;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_fifo_data_out_tag_t;

#define IIS3DWB10IS_FIFO_DATA_OUT_D0             0x41U
#define IIS3DWB10IS_FIFO_DATA_OUT_D1             0x42U
#define IIS3DWB10IS_FIFO_DATA_OUT_D2             0x43U
#define IIS3DWB10IS_FIFO_DATA_OUT_D3             0x44U
#define IIS3DWB10IS_FIFO_DATA_OUT_D4             0x45U
#define IIS3DWB10IS_FIFO_DATA_OUT_D5             0x46U
#define IIS3DWB10IS_FIFO_DATA_OUT_D6             0x47U
#define IIS3DWB10IS_FIFO_DATA_OUT_D7             0x48U
#define IIS3DWB10IS_FIFO_DATA_OUT_D8             0x49U

#define IIS3DWB10IS_FIFO_STATUS1                 0x4CU
typedef struct
{
  uint8_t diff_fifo                    : 8;
} iis3dwb10is_fifo_status1_t;

#define IIS3DWB10IS_FIFO_STATUS2                 0x4DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t diff_fifo                    : 4;
  uint8_t fifo_full_ia                 : 1;
  uint8_t counter_bdr_ia               : 1;
  uint8_t fifo_ovr_ia                  : 1;
  uint8_t fifo_wtm_ia                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_wtm_ia                  : 1;
  uint8_t fifo_ovr_ia                  : 1;
  uint8_t counter_bdr_ia               : 1;
  uint8_t fifo_full_ia                 : 1;
  uint8_t diff_fifo                    : 4;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_fifo_status2_t;

#define IIS3DWB10IS_INTERNAL_FREQ_FINE           0x50U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t internal_freq_fine           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t internal_freq_fine           : 8;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_internal_freq_fine_t;

