CoreMaker-lab/STM32C542CC_IIS3DWB10IS/STM32C5_IIS3DWB10IS_Project2/STM32C5_IIS3DWB10IS_Project2_cmake/iis3dwb10is_reg.h
#define IIS3DWB10IS_ISPU_DUMMYCFG1               0x52U
#define IIS3DWB10IS_ISPU_DUMMYCFG2               0x53U
#define IIS3DWB10IS_ISPU_DUMMYCFG3               0x54U
#define IIS3DWB10IS_ISPU_DUMMYCFG4               0x55U
#define IIS3DWB10IS_ISPU_DUMMYCFG5               0x56U
#define IIS3DWB10IS_ISPU_DUMMYCFG6               0x57U
#define IIS3DWB10IS_ISPU_DUMMYCFG7               0x58U
#define IIS3DWB10IS_ISPU_DUMMYCFG8               0x59U
#define IIS3DWB10IS_ISPU_DUMMYCFG9               0x5AU
#define IIS3DWB10IS_ISPU_DUMMYCFG10              0x5BU
#define IIS3DWB10IS_ISPU_DUMMYCFG11              0x5CU
#define IIS3DWB10IS_ISPU_DUMMYCFG12              0x5DU
#define IIS3DWB10IS_ISPU_DUMMYCFG13              0x5EU
#define IIS3DWB10IS_ISPU_DUMMYCFG14              0x5FU
#define IIS3DWB10IS_ISPU_DUMMYCFG15              0x60U
#define IIS3DWB10IS_ISPU_DUMMYCFG16              0x61U

#define IIS3DWB10IS_SLEEPCNT_TIME_L              0x62U
#define IIS3DWB10IS_SLEEPCNT_TIME_H              0x63U

#define IIS3DWB10IS_INT_CTRL4                    0x6EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_ispu                    : 1;
  uint8_t int1_ispu                    : 1;
  uint8_t int2_timer                   : 1;
  uint8_t int1_timer                   : 1;
  uint8_t not_used0                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t int1_timer                   : 1;
  uint8_t int2_timer                   : 1;
  uint8_t int1_ispu                    : 1;
  uint8_t int2_ispu                    : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_int_ctrl4_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page ispu
  * @{
  *
  */

#define IIS3DWB10IS_ISPU_CONFIG                  0x02U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t rst_n                        : 1;
  uint8_t clk_dis                      : 1;
  uint8_t not_used0                    : 1;
  uint8_t latched                      : 2;
  uint8_t not_used1                    : 1;
  uint8_t dbg_rst_sts                  : 1;
  uint8_t not_used2                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used2                    : 1;
  uint8_t dbg_rst_sts                  : 1;
  uint8_t not_used1                    : 1;
  uint8_t latched                      : 2;
  uint8_t not_used0                    : 1;
  uint8_t clk_dis                      : 1;
  uint8_t rst_n                        : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_config_t;

#define IIS3DWB10IS_ISPU_STATUS                  0x04U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t orun                         : 1;
  uint8_t not_used0                    : 5;
  uint8_t boot_end                     : 1;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t boot_end                     : 1;
  uint8_t not_used0                    : 5;
  uint8_t orun                         : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_status_t;

#define IIS3DWB10IS_ISPU_MEM_SEL                 0x07U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t rom_sel                      : 1;
  uint8_t not_used1                    : 3;
  uint8_t read_ram                     : 1;
  uint8_t not_used2                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used2                    : 1;
  uint8_t read_ram                     : 1;
  uint8_t not_used1                    : 3;
  uint8_t rom_sel                      : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_mem_sel_t;

#define IIS3DWB10IS_ISPU_MEM_ADDR2               0x08U
#define IIS3DWB10IS_ISPU_MEM_ADDR1               0x09U

#define IIS3DWB10IS_ISPU_MEM_DATA_1              0x0AU
#define IIS3DWB10IS_ISPU_MEM_DATA_2              0x0BU

#define IIS3DWB10IS_ISPU_IF2S_FLAG_L             0x0CU
#define IIS3DWB10IS_ISPU_IF2S_FLAG_H             0x0DU

#define IIS3DWB10IS_ISPU_S2IF_FLAG_L             0x0EU
#define IIS3DWB10IS_ISPU_S2IF_FLAG_H             0x0FU

#define IIS3DWB10IS_ISPU_DOUT_00_L               0x10U
#define IIS3DWB10IS_ISPU_DOUT_00_H               0x11U
#define IIS3DWB10IS_ISPU_DOUT_01_L               0x12U
#define IIS3DWB10IS_ISPU_DOUT_01_H               0x13U
#define IIS3DWB10IS_ISPU_DOUT_02_L               0x14U
#define IIS3DWB10IS_ISPU_DOUT_02_H               0x15U
#define IIS3DWB10IS_ISPU_DOUT_03_L               0x16U
#define IIS3DWB10IS_ISPU_DOUT_03_H               0x17U
#define IIS3DWB10IS_ISPU_DOUT_04_L               0x18U
#define IIS3DWB10IS_ISPU_DOUT_04_H               0x19U
#define IIS3DWB10IS_ISPU_DOUT_05_L               0x1AU
#define IIS3DWB10IS_ISPU_DOUT_05_H               0x1BU
#define IIS3DWB10IS_ISPU_DOUT_06_L               0x1CU
#define IIS3DWB10IS_ISPU_DOUT_06_H               0x1DU
#define IIS3DWB10IS_ISPU_DOUT_07_L               0x1EU
#define IIS3DWB10IS_ISPU_DOUT_07_H               0x1FU
#define IIS3DWB10IS_ISPU_DOUT_08_L               0x20U
#define IIS3DWB10IS_ISPU_DOUT_08_H               0x21U
#define IIS3DWB10IS_ISPU_DOUT_09_L               0x22U
#define IIS3DWB10IS_ISPU_DOUT_09_H               0x23U
#define IIS3DWB10IS_ISPU_DOUT_10_L               0x24U
#define IIS3DWB10IS_ISPU_DOUT_10_H               0x25U
#define IIS3DWB10IS_ISPU_DOUT_11_L               0x26U
#define IIS3DWB10IS_ISPU_DOUT_11_H               0x27U
#define IIS3DWB10IS_ISPU_DOUT_12_L               0x28U
#define IIS3DWB10IS_ISPU_DOUT_12_H               0x29U
#define IIS3DWB10IS_ISPU_DOUT_13_L               0x2AU
#define IIS3DWB10IS_ISPU_DOUT_13_H               0x2BU
#define IIS3DWB10IS_ISPU_DOUT_14_L               0x2CU
#define IIS3DWB10IS_ISPU_DOUT_14_H               0x2DU
#define IIS3DWB10IS_ISPU_DOUT_15_L               0x2EU
#define IIS3DWB10IS_ISPU_DOUT_15_H               0x2FU

#define IIS3DWB10IS_ISPU_INT1_CTRL1              0x50U
#define IIS3DWB10IS_ISPU_INT1_CTRL2              0x51U
#define IIS3DWB10IS_ISPU_INT2_CTRL1              0x54U
#define IIS3DWB10IS_ISPU_INT2_CTRL2              0x55U

#define IIS3DWB10IS_ISPU_INT_STATUS1             0x58U
#define IIS3DWB10IS_ISPU_INT_STATUS2             0x59U

#define IIS3DWB10IS_ISPU_INT_PIN                 0x5CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1                         : 1;
  uint8_t int2                         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2                         : 1;
  uint8_t int1                         : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ispu_int_pin_t;

#define IIS3DWB10IS_ISPU_ALGO1                   0x70U
#define IIS3DWB10IS_ISPU_ALGO2                   0x71U

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

