CoreMaker-lab/STM32C542CC_IIS3DWB10IS/STM32C5_IIS3DWB10IS_Project2/STM32C5_IIS3DWB10IS_Project2_cmake/iis3dwb10is_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t iis3dwb10is_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);
int32_t iis3dwb10is_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                              uint8_t *data,
                              uint16_t len);

int32_t iis3dwb10is_device_id_get(const stmdev_ctx_t *ctx, uint8_t *id);

uint64_t iis3dwb10is_from_lsb_to_us(uint64_t lsb);
float_t iis3dwb10is_from_lsb_to_celsius(int16_t lsb);

float_t iis3dwb10is_16b_from_fs50g_to_mg(int16_t lsb);
float_t iis3dwb10is_16b_from_fs100g_to_mg(int16_t lsb);
float_t iis3dwb10is_16b_from_fs200g_to_mg(int16_t lsb);
float_t iis3dwb10is_from_fs50g_to_mg(int32_t lsb);
float_t iis3dwb10is_from_fs100g_to_mg(int32_t lsb);
float_t iis3dwb10is_from_fs200g_to_mg(int32_t lsb);

typedef enum
{
  IIS3DWB10IS_MAIN_MEM_BANK =                    0x0,
  IIS3DWB10IS_ISPU_MEM_BANK =                    0x1,
  IIS3DWB10IS_ISPU_MEM_BANK_RAM_ACCESS =         0x3,
} iis3dwb10is_mem_bank_t;
int32_t iis3dwb10is_mem_bank_set(const stmdev_ctx_t *ctx, iis3dwb10is_mem_bank_t val);
int32_t iis3dwb10is_mem_bank_get(const stmdev_ctx_t *ctx, iis3dwb10is_mem_bank_t *val);

int32_t iis3dwb10is_reboot(const stmdev_ctx_t *ctx);
int32_t iis3dwb10is_sw_por(const stmdev_ctx_t *ctx);
int32_t iis3dwb10is_sw_reset(const stmdev_ctx_t *ctx);

typedef struct
{
  enum
  {
    IIS3DWB10IS_CONTINUOS_MODE     = 0x0, /* continuos mode */
    IIS3DWB10IS_TON_UI_TOFF_ISPU   = 0x1, /* Trig-ON: UI, Trig-OFF: ISPU */
    IIS3DWB10IS_TON_UI_TOFF_FIFO   = 0x2, /* Trig-ON: UI, Trig-OFF: FIFO */
    IIS3DWB10IS_TON_STC_TOFF_UI    = 0x4, /* Trig-ON: Sleep Timer Counter, Trig-OFF: UI */
    IIS3DWB10IS_TON_STC_TOFF_ISPU  = 0x5, /* Trig-ON: Sleep Timer Counter, Trig-OFF: ISPU */
    IIS3DWB10IS_TON_STC_TOFF_FIFO  = 0x6, /* Trig-ON: Sleep Timer Counter, Trig-OFF: FIFO */
    IIS3DWB10IS_TON_EXT_TOFF_UI    = 0x8, /* Trig-ON: External, Trigger off: UI */
    IIS3DWB10IS_TON_EXT_TOFF_ISPU  = 0x9, /* Trig-ON: External, Trigger off: ISPU */
    IIS3DWB10IS_TON_EXT_TOFF_FIFO  = 0xA, /* Trig-ON: External, Trig-OFF: FIFO */
  } burst;

  enum
  {
    IIS3DWB10IS_ODR_IDLE       = 0x0,
    IIS3DWB10IS_ODR_2KHz5      = 0x2,
    IIS3DWB10IS_ODR_5KHz       = 0x3,
    IIS3DWB10IS_ODR_10KHz      = 0x4,
    IIS3DWB10IS_ODR_20KHz      = 0x5,
    IIS3DWB10IS_ODR_40KHz      = 0x6,
    IIS3DWB10IS_ODR_80KHz      = 0x7,
  } odr;
} iis3dwb10is_data_rate_t;
int32_t iis3dwb10is_xl_data_rate_set(const stmdev_ctx_t *ctx, iis3dwb10is_data_rate_t val);
int32_t iis3dwb10is_xl_data_rate_get(const stmdev_ctx_t *ctx, iis3dwb10is_data_rate_t *val);

typedef enum
{
  IIS3DWB10IS_50g   = 0,
  IIS3DWB10IS_100g  = 1,
  IIS3DWB10IS_200g  = 2,
} iis3dwb10is_fs_xl_t;
int32_t iis3dwb10is_xl_full_scale_set(const stmdev_ctx_t *ctx, iis3dwb10is_fs_xl_t val);
int32_t iis3dwb10is_xl_full_scale_get(const stmdev_ctx_t *ctx, iis3dwb10is_fs_xl_t *val);

int32_t iis3dwb10is_block_data_update_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb10is_block_data_update_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  enum
  {
    IIS3DWB10IS_WRAPAROUND_DISABLED  = 0x0,
    IIS3DWB10IS_WRAPAROUND_1_EN      = 0x1,
    IIS3DWB10IS_WRAPAROUND_2_EN      = 0x2,
  } rounding;

  uint8_t x_axis_en : 1;
  uint8_t y_axis_en : 1;
  uint8_t z_axis_en : 1;
} iis3dwb10is_xl_data_cfg_t;
int32_t iis3dwb10is_xl_data_config_set(const stmdev_ctx_t *ctx, iis3dwb10is_xl_data_cfg_t val);
int32_t iis3dwb10is_xl_data_config_get(const stmdev_ctx_t *ctx, iis3dwb10is_xl_data_cfg_t *val);

typedef struct
{
  enum
  {
    IIS3DWB10IS_PAD_STRENGTH_LOWER        = 0x0,
    IIS3DWB10IS_PAD_STRENGTH_INTERMEDIATE = 0x1,
    IIS3DWB10IS_PAD_STRENGTH_HIGHEST      = 0x3,
  } strength;

  enum
  {
    IIS3DWB10IS_PD_INT1_ON_INT2_ON     = 0x0,
    IIS3DWB10IS_PD_INT1_OFF_INT2_ON    = 0x1,
    IIS3DWB10IS_PD_INT1_ON_INT2_OFF    = 0x2,
    IIS3DWB10IS_PD_INT1_OFF_INT2_OFF   = 0x3,
  } pd_dis;

  enum
  {
    IIS3DWB10IS_PUSH_PULL   = 0,
    IIS3DWB10IS_OPEN_DRAIN  = 1,
  } pp_od;

  uint8_t int_active_level : 1;
} iis3dwb10is_int_pin_t;
int32_t iis3dwb10is_interrupt_pin_mode_set(const stmdev_ctx_t *ctx, iis3dwb10is_int_pin_t val);
int32_t iis3dwb10is_interrupt_pin_mode_get(const stmdev_ctx_t *ctx, iis3dwb10is_int_pin_t *val);


typedef struct
{
  enum
  {
    IIS3DWB10IS_I3C_BUS_AVAIL_TIME_2US    = 0x0,
    IIS3DWB10IS_I3C_BUS_AVAIL_TIME_12_5US = 0x1,
    IIS3DWB10IS_I3C_BUS_AVAIL_TIME_25US   = 0x2,
    IIS3DWB10IS_I3C_BUS_AVAIL_TIME_50US   = 0x3,
  } bus_act_sel;
  uint8_t i3c_int_en                   : 1;
  uint8_t i3c_disable                  : 1;
  uint8_t sda_pu_en                    : 1;
} iis3dwb10is_i3c_cfg_t;
int32_t iis3dwb10is_i3c_configure_set(const stmdev_ctx_t *ctx, iis3dwb10is_i3c_cfg_t val);
int32_t iis3dwb10is_i3c_configure_get(const stmdev_ctx_t *ctx, iis3dwb10is_i3c_cfg_t *val);

typedef enum
{
  IIS3DWB10IS_SPI_4_WIRE  = 0x0, /* SPI 4 wires */
  IIS3DWB10IS_SPI_3_WIRE  = 0x1, /* SPI 3 wires */
} iis3dwb10is_spi_mode_t;
int32_t iis3dwb10is_spi_mode_set(const stmdev_ctx_t *ctx, iis3dwb10is_spi_mode_t val);
int32_t iis3dwb10is_spi_mode_get(const stmdev_ctx_t *ctx, iis3dwb10is_spi_mode_t *val);

typedef enum
{
  IIS3DWB10IS_LPF1_BW_20KHz         = 0x0,
  IIS3DWB10IS_LPF1_BW_17KHz2        = 0x1,
  IIS3DWB10IS_LPF1_BW_14KHz7        = 0x2,
  IIS3DWB10IS_LPF1_BW_12KHz         = 0x3,
  IIS3DWB10IS_LPF1_BW_9KHz32        = 0x4,
  IIS3DWB10IS_LPF1_BW_6KHz89        = 0x5,
  IIS3DWB10IS_LPF1_BW_4KHz55        = 0x6,
  IIS3DWB10IS_LPF1_BW_2KHz56        = 0x7,
  IIS3DWB10IS_LPF1_SWITCH_ODR       = 0x8,
} iis3dwb10is_lpf1_cfg_t;
int32_t iis3dwb10is_lpf1_cfg_set(const stmdev_ctx_t *ctx, iis3dwb10is_lpf1_cfg_t val);
int32_t iis3dwb10is_lpf1_cfg_get(const stmdev_ctx_t *ctx, iis3dwb10is_lpf1_cfg_t *val);

int32_t iis3dwb10is_fifo_watermark_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t iis3dwb10is_fifo_watermark_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t iis3dwb10is_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb10is_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx, uint8_t *val);

