CoreMaker-lab/STM32C542CC_IIS3DWB10IS/STM32C5_IIS3DWB10IS_Project2/STM32C5_IIS3DWB10IS_Project2_cmake/iis3dwb10is_reg.h
typedef enum
{
  IIS3DWB10IS_BYPASS_MODE             = 0x0,
  IIS3DWB10IS_FIFO_MODE               = 0x1,
  IIS3DWB10IS_STREAM_MODE             = 0x2,
  IIS3DWB10IS_STREAM_TO_FIFO_MODE     = 0x3,
  IIS3DWB10IS_BYPASS_TO_STREAM_MODE   = 0x4,
  IIS3DWB10IS_BYPASS_TO_FIFO_MODE     = 0x7,
  IIS3DWB10IS_FIFO_OFF                = 0x8,
} iis3dwb10is_fifo_mode_t;
int32_t iis3dwb10is_fifo_mode_set(const stmdev_ctx_t *ctx, iis3dwb10is_fifo_mode_t val);
int32_t iis3dwb10is_fifo_mode_get(const stmdev_ctx_t *ctx, iis3dwb10is_fifo_mode_t *val);

typedef struct
{
  uint8_t batch_xl   : 1;
  uint8_t batch_temp : 1;
  uint8_t batch_ispu : 1;
  enum
  {
    IIS3DWB10IS_TMSTMP_NOT_BATCHED = 0x0,
    IIS3DWB10IS_TMSTMP_DEC_1       = 0x1,
    IIS3DWB10IS_TMSTMP_DEC_8       = 0x2,
    IIS3DWB10IS_TMSTMP_DEC_32      = 0x3,
  } batch_ts;
} iis3dwb10is_fifo_sensor_batch_t;
int32_t iis3dwb10is_fifo_batch_set(const stmdev_ctx_t *ctx, iis3dwb10is_fifo_sensor_batch_t val);
int32_t iis3dwb10is_fifo_batch_get(const stmdev_ctx_t *ctx, iis3dwb10is_fifo_sensor_batch_t *val);

typedef struct
{
  enum
  {
    IIS3DWB10IS_FIFO_TRIGGER_ISPU   = 0,
    IIS3DWB10IS_FIFO_TRIGGER_INT2   = 1,
  } trigger;
  uint8_t read_from_ispu : 1;
} iis3dwb10is_fifo_ispu_ctrl_batch_t;
int32_t iis3dwb10is_fifo_ispu_ctrl_set(const stmdev_ctx_t *ctx,
                                       iis3dwb10is_fifo_ispu_ctrl_batch_t val);
int32_t iis3dwb10is_fifo_ispu_ctrl_get(const stmdev_ctx_t *ctx,
                                       iis3dwb10is_fifo_ispu_ctrl_batch_t *val);

typedef struct
{
  uint16_t fifo_level          : 12;
  uint8_t  fifo_full           : 1;
  uint8_t  fifo_ovr            : 1;
  uint8_t  fifo_th             : 1;
} iis3dwb10is_fifo_status_t;

int32_t iis3dwb10is_fifo_status_get(const stmdev_ctx_t *ctx, iis3dwb10is_fifo_status_t *val);

#define FIFO_ROW_LEN 10U

typedef struct
{
  enum
  {
    IIS3DWB10IS_TAG_EMPTY                 = 0x00,
    IIS3DWB10IS_TAG_XL                    = 0x10,
    IIS3DWB10IS_TAG_TEMP                  = 0x18,
    IIS3DWB10IS_TAG_TS                    = 0x20,
  } tag;

  uint8_t raw[FIFO_ROW_LEN - 1];
  struct
  {
    int32_t x_raw    : 20;
    int32_t y_raw    : 20;
    int32_t z_raw    : 20;
  } xl;
  int16_t temp_raw;
  uint64_t ts_raw;
} iis3dwb10is_fifo_out_raw_t;
int32_t iis3dwb10is_fifo_process(uint8_t *fifo_buf, iis3dwb10is_fifo_out_raw_t *val);

int32_t iis3dwb10is_fifo_out_raw_get(const stmdev_ctx_t *ctx, uint8_t *fifo_buf, uint16_t cnt);

int32_t iis3dwb10is_counter_bdr_cfg_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t iis3dwb10is_counter_bdr_cfg_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef struct
{
  enum
  {
    IIS3DWB10IS_SLP_TICK_SLOW   = 0x0,
    IIS3DWB10IS_SLP_TICK_FAST    = 0x1,
  } tick_sel;
  uint8_t enable               : 1;
  uint8_t reset                : 1;
  uint16_t threshold_val;
} iis3dwb10is_slpcnt_cfg_t;
int32_t iis3dwb10is_sleepcnt_cfg_set(const stmdev_ctx_t *ctx, iis3dwb10is_slpcnt_cfg_t val);
int32_t iis3dwb10is_sleepcnt_cfg_get(const stmdev_ctx_t *ctx, iis3dwb10is_slpcnt_cfg_t *val);

int32_t iis3dwb10is_sleepcnt_time_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t iis3dwb10is_sleepcnt_time_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t iis3dwb10is_burst_ui_trigger_set(const stmdev_ctx_t *ctx, uint8_t val);

typedef struct
{
  enum
  {
    IIS3DWB10IS_PLL_NO_DIVIDER        = 0x0,
    IIS3DWB10IS_PLL_DIV_2             = 0x1,
    IIS3DWB10IS_PLL_DIV_4             = 0x2,
    IIS3DWB10IS_PLL_DIV_8             = 0x3,
    IIS3DWB10IS_PLL_DIV_16            = 0x4,
    IIS3DWB10IS_PLL_DIV_32            = 0x5,
    IIS3DWB10IS_PLL_DIV_64            = 0x6,
    IIS3DWB10IS_PLL_DIV_128           = 0x7,
  } ref_div;

  enum
  {
    IIS3DWB10IS_PLL_INTERNAL_CLOCK    = 0x0,
    IIS3DWB10IS_PLL_EXTERNAL_CLOCK    = 0x1,
  } osc_ext_sel;

  uint8_t pll_div : 6;
} iis3dwb10is_pll_ctrl_t;
int32_t iis3dwb10is_pll_ctrl_set(const stmdev_ctx_t *ctx, iis3dwb10is_pll_ctrl_t val);
int32_t iis3dwb10is_pll_ctrl_get(const stmdev_ctx_t *ctx, iis3dwb10is_pll_ctrl_t *val);

typedef enum
{
  IIS3DWB10IS_DRDY_LEVEL   = 0x0,
  IIS3DWB10IS_DRDY_PULSED  = 0x1,
} iis3dwb10is_data_ready_mode_t;
int32_t iis3dwb10is_data_ready_mode_set(const stmdev_ctx_t *ctx, iis3dwb10is_data_ready_mode_t val);
int32_t iis3dwb10is_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                        iis3dwb10is_data_ready_mode_t *val);

typedef struct
{
  uint8_t drdy_xl              : 1;
  uint8_t sleep_cnt            : 1;
  uint8_t ext_trig             : 1;
  uint8_t fifo_th              : 1;
  uint8_t fifo_ovr             : 1;
  uint8_t fifo_full            : 1;
  uint8_t counter_bdr          : 1;
  uint8_t drdy_temp            : 1;
  uint8_t boot                 : 1;
  uint8_t sleep_ispu           : 1;
  uint8_t int2_on_int1         : 1;
} iis3dwb10is_pin_int_route_t;
int32_t iis3dwb10is_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                       iis3dwb10is_pin_int_route_t val);
int32_t iis3dwb10is_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                       iis3dwb10is_pin_int_route_t *val);
int32_t iis3dwb10is_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                       iis3dwb10is_pin_int_route_t val);
int32_t iis3dwb10is_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                       iis3dwb10is_pin_int_route_t *val);

typedef struct
{
  uint8_t drdy_xl              : 1;
  uint8_t drdy_temp            : 1;
  uint8_t sleepcnt_ia          : 1;
  uint8_t ext_trig_ia          : 1;
  uint8_t ispu_ia              : 1;
  uint8_t timestamp_endcount   : 1;
} iis3dwb10is_data_ready_t;
int32_t iis3dwb10is_data_ready_get(const stmdev_ctx_t *ctx, iis3dwb10is_data_ready_t *val);

int32_t iis3dwb10is_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);
int32_t iis3dwb10is_acceleration_16b_raw_get(const stmdev_ctx_t *ctx, int16_t *val);
int32_t iis3dwb10is_acceleration_raw_get(const stmdev_ctx_t *ctx, int32_t *val);

int32_t iis3dwb10is_ispu_enable(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb10is_ispu_reset(const stmdev_ctx_t *ctx);
int32_t iis3dwb10is_ispu_timestamp_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb10is_ispu_timestamp_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

